NixOS/benchmarks/HPC/openfoam/OpenFOAM-v2306/tutorials/multiphase/interFoam/laminar/waves/mangroveInteraction/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    {
        name    c0;
        type    cellZoneSet;
        action  new;
        source  fieldToCell;

        field   MangrovesIndex;
        min     0.5;
        max     1.5;
    }
);


// ************************************************************************* //
